Revit 2027 API
BuiltInFailures.PropertySetElementFailures Class
 Failures related to property set elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PropertySetElementFailures
Public NotInheritable Class PropertySetElementFailures
public ref class PropertySetElementFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PropertySetElementFailures = class end
The BuiltInFailures.PropertySetElementFailures type exposes the following members.
Properties
Name | Description
EmptyPropertySetName |  A property set name cannot be an empty string.
NonStringParameterValue |  The given parameter requires a string value.
NonUniquePropertySetName |  The value of the given parameter is already in use as a property set name.
Top
See Also
Reference
Autodesk.Revit.DB Namespace